###################################################################

# Created by write_sdc on Mon Oct 30 21:04:49 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF    \
-voltage V -current uA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {Out_OFM[35]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[34]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[33]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[32]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[31]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[30]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[29]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[28]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[27]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[26]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[25]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[24]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[23]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[22]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[21]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[20]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[19]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[18]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[17]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[16]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[15]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[14]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[13]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[12]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[11]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[10]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[9]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[8]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[7]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[6]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[5]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[4]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[3]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[2]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[1]}]
set_load -pin_load 0.05 [get_ports {Out_OFM[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 1100  -waveform {0 550}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  550  [get_ports in_valid]
set_input_delay -clock clk  550  [get_ports weight_valid]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[15]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[14]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[13]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[12]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[11]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[10]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[9]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[8]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[7]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[6]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[5]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[4]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[3]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[2]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[1]}]
set_input_delay -clock clk  550  [get_ports {In_IFM_1[0]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[15]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[14]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[13]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[12]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[11]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[10]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[9]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[8]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[7]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[6]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[5]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[4]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[3]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[2]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[1]}]
set_input_delay -clock clk  550  [get_ports {In_Weight_1[0]}]
set_output_delay -clock clk  550  [get_ports out_valid]
set_output_delay -clock clk  550  [get_ports {Out_OFM[35]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[34]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[33]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[32]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[31]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[30]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[29]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[28]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[27]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[26]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[25]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[24]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[23]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[22]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[21]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[20]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[19]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[18]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[17]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[16]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[15]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[14]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[13]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[12]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[11]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[10]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[9]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[8]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[7]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[6]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[5]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[4]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[3]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[2]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[1]}]
set_output_delay -clock clk  550  [get_ports {Out_OFM[0]}]
